src/test/resources/recipe-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:chick="urn:chicken:recipes">
    <soap:Header/>
    <soap:Body>
        <chick:getRecipeRequest>
            <chick:country>France</chick:country>
        </chick:getRecipeRequest>
    </soap:Body>
</soap:Envelope>